<template>
  <div class="content">
    <div class="header" @click="$router.push('/')">
      测试ios问题
    </div>
    <div class="footer">
      <div class="list">芜城，九月。

　　坐落在巷尾的独立小楼内，正进行着一场与众不同的心理治疗。

　　陆眠就那么随意的坐在沙发上，食指缠着碎发，微微笑着看向对面。

　　她抿了一口水，放下杯子的同时，顺手抄起了桌上的笔。

　　普通的圆珠笔，就像活了一般，一一绕过她修长皙白的手指，一圈又一圈的缠绕着。

　　“开始吧。”她语气轻淡。

　　对面的年轻男人失笑，怎么感觉身份对调了。

　　明明他才是心理医生，却被患者占据了主导地位。

　　旋即，他垂眸看向手中的病例。

　　【陆眠，女，19岁，AorB特大绑架案的最后一名受害者，半月前被平安救回。】

　　这些信息他早就熟记于心。

　　但——

　　很难想象面前这个风轻云淡、若无其事的女孩，就是受害者本人。

　　“陆眠，我们可以像朋友般的聊一聊吗？你的家人都很担心你，他们希望通过我，能更多的了解你。”

　　陆眠兴致缺缺，右手转笔的动作没有停，左手却无聊到掏出手机打发时间。

　　一心二用的做着别的事，还不忘偶尔冲对面眨下眼睛，加之左耳软骨处若隐若现的小红痣，又冷又美还撩。

　　但那双平静含笑的清眸深处，却没有温度，只染着莫挨老子的不羁与邪气。

　　心理医生叶谨闻眉心微皱了一下。

　　这绝对是他遇到的第二个这么难以接近的人！

　　第一个，当然是……

　　扯远了。

　　叶谨闻耐着性子，继续单方面的攻克着。

　　“能不能告诉我，在你被绑架的两年里，都发生了什么事？”

　　“我忘了。”

　　“那你还记得救你回来的神秘人吗？你认不认识那人？”

　　“不认识。”

　　“你是怎么看待自己父母和妹妹的？”

　　“挺好的。”

　　“……”叶谨闻觉得自己遇到了心理治疗生涯中的瓶颈。

　　患者不慌不忙，他却烦躁的有些坐不住了。

　　这已经是第四次治疗了！

　　每次都是这些回答！

　　不管他怎么疏导开解，她都毫不动摇，甚至从她的表情上看不出任何撒谎的痕迹。

　　但直觉告诉他，即使陆眠不是PTSD患者，也绝对有问题！

　　他不由得想起陆眠母亲嘱咐自己话：陆眠从小就是个撒谎精，她的话不能信！

　　难道，要动用强硬手段才能使她说出真相……

　　时间很快过去。

　　陆眠在结束第二十局游戏后，人也从沙发上站了起来。

　　好看的眉眼勾着笑意扫过监控镜头，将圆珠笔还给了叶谨闻。

　　如同完成某项任务，治疗时间结束，她也该走了。

　　“陆眠！”

　　叶谨闻急急追上两步，冲着她纤瘦清冷的背影，脱口而出：“我没有恶意的，我只是想要帮助你！”

　　陆眠掉过头，一声“呵”从口中轻轻飘出，她笑得无所顾忌。

　　“叶医生，假装关心你的病人，你不累吗？”

　　“……”说话也太噎人了！

　　叶谨闻带着挫败感回到了隔壁办公室。

　　推开门的瞬间，便看到高定沙发上那幅赏心悦目的画面，心情立马好了许多。

　　沙发上坐着一个男人，他单手撑着一双膝盖，俯身看着茶几上的监控画面。

　　因为倾身的动作，灰色衬衫领口微微敞开，露出一片冷白皮肤。

　　往上则是那张看似斯文，实则冷到无人敢直视的完美侧颜。

　　而那双金框眼镜下的冰眸，正专注耐心的盯着监控画面。

　　画面锁定之处，正是陆眠。

　　——

　　铜钱新书，求支持求收藏！强强联合，互宠互撩~

　　女主陆眠【美强撩酷拽小姐姐，芜城，九月。

　　坐落在巷尾的独立小楼内，正进行着一场与众不同的心理治疗。

　　陆眠就那么随意的坐在沙发上，食指缠着碎发，微微笑着看向对面。

　　她抿了一口水，放下杯子的同时，顺手抄起了桌上的笔。

　　普通的圆珠笔，就像活了一般，一一绕过她修长皙白的手指，一圈又一圈的缠绕着。

　　“开始吧。”她语气轻淡。

　　对面的年轻男人失笑，怎么感觉身份对调了。

　　明明他才是心理医生，却被患者占据了主导地位。

　　旋即，他垂眸看向手中的病例。

　　【陆眠，女，19岁，AorB特大绑架案的最后一名受害者，半月前被平安救回。】

　　这些信息他早就熟记于心。

　　但——

　　很难想象面前这个风轻云淡、若无其事的女孩，就是受害者本人。

　　“陆眠，我们可以像朋友般的聊一聊吗？你的家人都很担心你，他们希望通过我，能更多的了解你。”

　　陆眠兴致缺缺，右手转笔的动作没有停，左手却无聊到掏出手机打发时间。

　　一心二用的做着别的事，还不忘偶尔冲对面眨下眼睛，加之左耳软骨处若隐若现的小红痣，又冷又美还撩。

　　但那双平静含笑的清眸深处，却没有温度，只染着莫挨老子的不羁与邪气。

　　心理医生叶谨闻眉心微皱了一下。

　　这绝对是他遇到的第二个这么难以接近的人！

　　第一个，当然是……

　　扯远了。

　　叶谨闻耐着性子，继续单方面的攻克着。

　　“能不能告诉我，在你被绑架的两年里，都发生了什么事？”

　　“我忘了。”

　　“那你还记得救你回来的神秘人吗？你认不认识那人？”

　　“不认识。”

　　“你是怎么看待自己父母和妹妹的？”

　　“挺好的。”

　　“……”叶谨闻觉得自己遇到了心理治疗生涯中的瓶颈。

　　患者不慌不忙，他却烦躁的有些坐不住了。

　　这已经是第四次治疗了！

　　每次都是这些回答！

　　不管他怎么疏导开解，她都毫不动摇，甚至从她的表情上看不出任何撒谎的痕迹。

　　但直觉告诉他，即使陆眠不是PTSD患者，也绝对有问题！

　　他不由得想起陆眠母亲嘱咐自己话：陆眠从小就是个撒谎精，她的话不能信！

　　难道，要动用强硬手段才能使她说出真相……

　　时间很快过去。

　　陆眠在结束第二十局游戏后，人也从沙发上站了起来。

　　好看的眉眼勾着笑意扫过监控镜头，将圆珠笔还给了叶谨闻。

　　如同完成某项任务，治疗时间结束，她也该走了。

　　“陆眠！”

　　叶谨闻急急追上两步，冲着她纤瘦清冷的背影，脱口而出：“我没有恶意的，我只是想要帮助你！”

　　陆眠掉过头，一声“呵”从口中轻轻飘出，她笑得无所顾忌。

　　“叶医生，假装关心你的病人，你不累吗？”

　　“……”说话也太噎人了！

　　叶谨闻带着挫败感回到了隔壁办公室。

　　推开门的瞬间，便看到高定沙发上那幅赏心悦目的画面，心情立马好了许多。

　　沙发上坐着一个男人，他单手撑着一双膝盖，俯身看着茶几上的监控画面。

　　因为倾身的动作，灰色衬衫领口微微敞开，露出一片冷白皮肤。

　　往上则是那张看似斯文，实则冷到无人敢直视的完美侧颜。

　　而那双金框眼镜下的冰眸，正专注耐心的盯着监控画面。

　　画面锁定之处，正是陆眠。

　　——

　　铜钱新书，求支持求收藏！强强联合，互宠互撩~

　　女主陆眠【美强撩酷拽小姐姐，</div>
    </div>
  </div>
</template>
<script>
export default {

}
</script>
<style lang="scss" scoped>
  .content{
    display: flex;
    flex-direction: column;
    height: 100%;
    .header{
      height: 1rem;
      background:firebrick;
      text-align: center;
      font-size: 18px;
      line-height: 1rem;
      color: #fff;
    }
    .footer{
      flex: 1;
      overflow:scroll;
      .list{
        background: #ddd;
      }
    }
  }
</style>
