// 常用的正则验证
export const REG_RULE = {
  normal:{
    reg: /^[0-9a-zA-Z\u4e00-\u9fa5 ]+$/,
    tip: '格式不正确',//常规输入框的验证，只能输入中文，字母，数字，限制特殊字符输入；
  },
  mobile: {
    reg: /^1[3|4|5|6|7|8|9][0-9]{9}$/,
    tip: '手机号码格式不正确'
  },
  bankNo:{
    reg:/^([1-9]{1})(\d{15}|\d{16}|\d{17}|\d{18})$/,//第一位不能0开头，支持16,17,18,19位数字（注：第一位占一位）
    tip:'银行卡号格式不正确'
  },
  username: {
    //账号名称
    reg: /^[a-zA-Z][a-zA-Z_0-9]{5,10}$/,
    // tip: "账号由6-10位字母、数字或下划线组成"
    //账户以字母开头，长度6-10位，不能用特殊符号
    tip:'账号以字母开头，由6-10位字母和数字或下划线组成'
  },
  nickname:{
    //昵称
    reg: /^[0-9a-zA-Z\u4e00-\u9fa5]{2,15}$/,
    tip: "昵称由2-15个汉字、字母或数字组成"
  },
  realName: {
    //真实姓名
    reg: /^[\u4e00-\u9fa5]{2,20}$/,
    tip: '真实姓名为2到20位中文'
  },
  email: {
    reg: /^[a-zA-Z0-9_-]+@[a-zA-Z0-9_-]+(\.[a-zA-Z0-9_-]+)+$/,
    tip: '邮箱格式不正确'
  },
  oldPwd:{
    reg: /^[0-9A-Za-z]{6,15}$/,
    tip: '',//旧密码只做简单校验
  },
  loginPwd: {
    reg:/^(?![0-9]+$)(?![a-zA-Z]+$)([0-9A-Za-z]|[_]){6,12}$/,
    tip: '密码由6-12位字母和数字或下划线组成,不能纯数字'
  },
  registerPassword: {
    reg: /^[0-9A-Za-z]{6,24}$/,
    tip: '密码由6到24位字母或数字组合'
  },
  verifyImg: {
    reg: /^([0-9]){5}$/,
    tip: '图片验证码由5位数字组成'
  },
  verifyCode: {
    reg: /^([0-9]){4}$/,
    tip: '短信验证码由4位数字组成'
  },
  verifyEmailCode: {
    reg: /^([0-9]){4}$/,
    tip: '验证码由4位数字组成'
  },
  cardId: {
    reg: /^[1-9]{1}[0-9]{14}$|^[1-9]{1}[0-9]{16}([0-9]|[xX])$/,
    tip: '身份证格式不正确'
  },
  ip: {
    reg: /^(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])(\.(\d{1,2}|1\d\d|2[0-4]\d|25[0-5])){3}$/,
    tip: 'ip格式不正确'
  },
  fundPsw: {
    // reg: /^[a-zA-Z_]{1}\w{7,23}$/,
    reg: /^\d{6}$/,
    tip: "请输入6位纯数字"
  },
  qq: {
    reg: /^([0-9]){4,15}$/,
    tip: "QQ号格式不正确"
  },
  weChat: {
    reg: /^[a-zA-Z]{1}[-_a-zA-Z0-9]{5,19}$/,
    tip: "微信号格式不正确"
  },
  spreadCode:{
    reg:/^[a-zA-Z-0-9]{3,10}$/,
    tip:'推广码由3-10位字母或数字组成',
  },

}
export const TOAST_SHOW_TIME = 1000
